libvirt/libvirt-ubuntu.org
#+OPTIONS: num:nil toc:nil html-postamble:nil html-style:nil

* Libvirt setup for Ubuntu 18.04LTS
   

** Confirm that virulization is enabled
#+ATTR_HTML: :textarea t :width 80
#+BEGIN_EXAMPLE
kvm-ok
#+END_EXAMPLE
kvm-ok checks that kvm module is loaded and that the /dev/kvm is present

** Required Packages
#+ATTR_HTML: :textarea t :width 80
#+BEGIN_SRC sh
sudo apt install qemu-kvm libvirt-clients libvirt-daemon-system bridge-utils virt-manager
#+END_SRC

** Service Configuration
- start and enable the libvirtd
#+ATTR_HTML: :textarea t :width 80
#+BEGIN_SRC sh
sudo systemctl start libvirtd && sudo systemctl enable libvirtd
#+END_SRC


- confirm startup and that service is enabled
#+ATTR_HTML: :textarea t :width 80
#+BEGIN_EXAMPLE
systemctl status libvirtd
#+END_EXAMPLE

** Allow a regular user to use libvirt

- add group to the libvirt group
#+ATTR_HTML: :textarea t :width 80
#+BEGIN_EXAMPLE
sudo usermod -aG libvirt user
sudo usermod -aG libvirt-qemu user
sudo usermod -aG libvirt-dnsmasq user
#+END_EXAMPLE
