libvirt/libvirt-ubuntu.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-05-27 Mon 21:52 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
</head>
<body>
<div id="content">

<div id="outline-container-org2fb8f7e" class="outline-2">
<h2 id="org2fb8f7e">Libvirt setup for Ubuntu 18.04LTS</h2>
<div class="outline-text-2" id="text-org2fb8f7e">
</div>
<div id="outline-container-org8e0f843" class="outline-3">
<h3 id="org8e0f843">Confirm that virulization is enabled</h3>
<div class="outline-text-3" id="text-org8e0f843">
<p>
<textarea cols="80" rows="1">
kvm-ok</textarea>
</p>
<p>
kvm-ok checks that kvm module is loaded and that the /dev/kvm is present
</p>
</div>
</div>

<div id="outline-container-org6606349" class="outline-3">
<h3 id="org6606349">Required Packages</h3>
<div class="outline-text-3" id="text-org6606349">
<p>
<textarea cols="80" rows="1">
sudo apt install qemu-kvm libvirt-clients libvirt-daemon-system bridge-utils virt-manager</textarea>
</p>
</div>
</div>

<div id="outline-container-orgd338bd5" class="outline-3">
<h3 id="orgd338bd5">Service Configuration</h3>
<div class="outline-text-3" id="text-orgd338bd5">
<ul class="org-ul">
<li>start and enable the libvirtd</li>
</ul>
<p>
<textarea cols="80" rows="1">
sudo systemctl start libvirtd && sudo systemctl enable libvirtd</textarea>
</p>


<ul class="org-ul">
<li>confirm startup and that service is enabled</li>
</ul>
<p>
<textarea cols="80" rows="1">
systemctl status libvirtd</textarea>
</p>
</div>
</div>

<div id="outline-container-org5a49419" class="outline-3">
<h3 id="org5a49419">Allow a regular user to use libvirt</h3>
<div class="outline-text-3" id="text-org5a49419">
<ul class="org-ul">
<li>add group to the libvirt group</li>
</ul>
<p>
<textarea cols="80" rows="3">
sudo usermod -aG libvirt user
sudo usermod -aG libvirt-qemu user
sudo usermod -aG libvirt-dnsmasq user</textarea>
</p>
</div>
</div>
</div>
</div>
</body>
</html>
